vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MKE12Z9_DFP.pdsc
    <condition id="device.startup.condition_id">
      <require condition="allOf.device.system, device=MKE12Z9.internal_condition"/>
    </condition>
    <condition id="allOf.device.system, device=MKE12Z9.internal_condition">
      <require Cclass="Device" Cgroup="CMSIS" Csub="MKE12Z9_system"/>
      <require condition="device.MKE12Z9.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=iar.condition_id">
      <require condition="toolchains.iar.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=armgcc.condition_id">
      <require condition="toolchains.armgcc.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=mdk.condition_id">
      <require condition="toolchains.mdk.internal_condition"/>
    </condition>
    <condition id="device.system.condition_id">
      <require condition="allOf.device.CMSIS, device=MKE12Z9.internal_condition"/>
    </condition>
    <condition id="allOf.device.CMSIS, device=MKE12Z9.internal_condition">
      <require Cclass="Device" Cgroup="CMSIS" Csub="MKE12Z9_header"/>
      <require condition="device.MKE12Z9.internal_condition"/>
    </condition>
    <condition id="driver.acmp.condition_id">
      <require condition="allOf.driver.common, device_id=MKE12Z512xxx9.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, device_id=MKE12Z512xxx9.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device_id.MKE12Z512xxx9.internal_condition"/>
    </condition>
    <condition id="driver.adc12.condition_id">
      <require condition="allOf.driver.common, device_id=MKE12Z512xxx9.internal_condition"/>
    </condition>
    <condition id="driver.clock.condition_id">
      <require condition="allOf.device=MKE12Z9.internal_condition"/>
    </condition>
    <condition id="driver.cmsis_lpi2c.condition_id">
      <require condition="allOf.CMSIS_Driver_Include.I2C, anyOf=allOf=driver.lpi2c, device_id=MKE12Z512xxx9, device.RTE, device_id=MKE12Z512xxx9, driver.lpi2c_edma.internal_condition"/>
    </condition>
    <condition id="allOf.CMSIS_Driver_Include.I2C, anyOf=allOf=driver.lpi2c, device_id=MKE12Z512xxx9, device.RTE, device_id=MKE12Z512xxx9, driver.lpi2c_edma.internal_condition">
      <require Cclass="CMSIS Driver" Cgroup="I2C" Capiversion="2.4.0"/>
      <require condition="anyOf.allOf=driver.lpi2c, device_id=MKE12Z512xxx9.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
      <require condition="device_id.MKE12Z512xxx9.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_edma"/>
    </condition>
    <condition id="anyOf.allOf=driver.lpi2c, device_id=MKE12Z512xxx9.internal_condition">
      <accept condition="allOf.driver.lpi2c, device_id=MKE12Z512xxx9.internal_condition"/>
    </condition>
    <condition id="allOf.driver.lpi2c, device_id=MKE12Z512xxx9.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c"/>
      <require condition="device_id.MKE12Z512xxx9.internal_condition"/>
    </condition>
    <condition id="driver.cmsis_lpspi.condition_id">
      <require condition="allOf.CMSIS_Driver_Include.SPI, anyOf=allOf=driver.lpspi, device_id=MKE12Z512xxx9, device.RTE, device_id=MKE12Z512xxx9, driver.lpspi_edma.internal_condition"/>
    </condition>
    <condition id="allOf.CMSIS_Driver_Include.SPI, anyOf=allOf=driver.lpspi, device_id=MKE12Z512xxx9, device.RTE, device_id=MKE12Z512xxx9, driver.lpspi_edma.internal_condition">
      <require Cclass="CMSIS Driver" Cgroup="SPI" Capiversion="2.3.0"/>
      <require condition="anyOf.allOf=driver.lpspi, device_id=MKE12Z512xxx9.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
      <require condition="device_id.MKE12Z512xxx9.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpspi_edma"/>
    </condition>
    <condition id="anyOf.allOf=driver.lpspi, device_id=MKE12Z512xxx9.internal_condition">
      <accept condition="allOf.driver.lpspi, device_id=MKE12Z512xxx9.internal_condition"/>
    </condition>
    <condition id="allOf.driver.lpspi, device_id=MKE12Z512xxx9.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpspi"/>
      <require condition="device_id.MKE12Z512xxx9.internal_condition"/>
    </condition>
    <condition id="driver.cmsis_lpuart.condition_id">
      <require condition="allOf.CMSIS_Driver_Include.USART, anyOf=allOf=driver.lpuart, device_id=MKE12Z512xxx9, device.RTE, device_id=MKE12Z512xxx9, driver.lpuart_edma.internal_condition"/>
    </condition>
    <condition id="allOf.CMSIS_Driver_Include.USART, anyOf=allOf=driver.lpuart, device_id=MKE12Z512xxx9, device.RTE, device_id=MKE12Z512xxx9, driver.lpuart_edma.internal_condition">
      <require Cclass="CMSIS Driver" Cgroup="USART" Capiversion="2.4.0"/>
      <require condition="anyOf.allOf=driver.lpuart, device_id=MKE12Z512xxx9.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
      <require condition="device_id.MKE12Z512xxx9.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart_edma"/>
    </condition>
    <condition id="anyOf.allOf=driver.lpuart, device_id=MKE12Z512xxx9.internal_condition">
      <accept condition="allOf.driver.lpuart, device_id=MKE12Z512xxx9.internal_condition"/>
    </condition>
    <condition id="allOf.driver.lpuart, device_id=MKE12Z512xxx9.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart"/>
      <require condition="device_id.MKE12Z512xxx9.internal_condition"/>
    </condition>
    <condition id="driver.cmsis_uart.condition_id">
      <require condition="allOf.CMSIS_Driver_Include.USART, device.RTE, driver.uart, device_id=MKE12Z512xxx9, driver.uart_edma.internal_condition"/>
    </condition>
