vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MKE12Z9_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="debugconsole_lite" Cversion="1.0.0" condition="component.log.backend.debug_console_lite.condition_id">
      <description>Component log backend debug console lite</description>
      <files>
        <file category="header" name="components/log/fsl_component_log_backend_debugconsole.h" projectpath="component/log"/>
        <file category="sourceC" name="components/log/fsl_component_log_backend_debugconsole.c" projectpath="component/log"/>
        <file category="include" name="components/log/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ringbuffer" Cversion="1.0.0" condition="component.log.backend.ringbuffer.condition_id">
      <description>Component log backend ring buffer</description>
      <files>
        <file category="header" name="components/log/fsl_component_log_backend_ringbuffer.h" projectpath="component/log"/>
        <file category="sourceC" name="components/log/fsl_component_log_backend_ringbuffer.c" projectpath="component/log"/>
        <file category="include" name="components/log/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lpspi_adapter" Cversion="1.0.0" condition="component.lpspi_adapter.condition_id">
      <description>Component lpspi_adapter</description>
      <files>
        <file category="header" name="components/spi/fsl_adapter_spi.h" projectpath="component/spi"/>
        <file category="sourceC" name="components/spi/fsl_adapter_lpspi.c" projectpath="component/spi"/>
        <file category="include" name="components/spi/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart_adapter" Cversion="1.0.0" condition="component.lpuart_adapter.condition_id">
      <description>Component lpuart_adapter</description>
      <files>
        <file category="header" name="components/uart/fsl_adapter_uart.h" projectpath="component/uart"/>
        <file category="sourceC" name="components/uart/fsl_adapter_lpuart.c" projectpath="component/uart"/>
        <file category="include" name="components/uart/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="panic" Cversion="1.0.0" condition="component.panic.condition_id">
      <description>Component panic</description>
      <files>
        <file category="header" name="components/panic/fsl_component_panic.h" projectpath="component/panic"/>
        <file category="sourceC" name="components/panic/fsl_component_panic.c" projectpath="component/panic"/>
        <file category="include" name="components/panic/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="reset_adapter" Cversion="1.0.0" condition="component.reset_adapter.condition_id">
      <description>Component reset_adapter</description>
      <files>
        <file category="header" name="components/reset/fsl_adapter_reset.h" projectpath="component/reset"/>
        <file category="sourceC" name="components/reset/fsl_adapter_reset.c" projectpath="component/reset"/>
        <file category="include" name="components/reset/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager" Cversion="1.0.1" condition="component.serial_manager.condition_id">
      <description>Component serial_manager</description>
      <files>
        <file category="header" name="components/serial_manager/fsl_component_serial_manager.h" projectpath="component/serial_manager"/>
        <file category="header" name="components/serial_manager/fsl_component_serial_port_internal.h" projectpath="component/serial_manager"/>
        <file category="sourceC" name="components/serial_manager/fsl_component_serial_manager.c" projectpath="component/serial_manager"/>
        <file category="include" name="components/serial_manager/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_spi" Cversion="1.0.0" condition="component.serial_manager_spi.condition_id">
      <description>Component serial_manager_spi</description>
      <RTE_Components_h>
        #ifndef SERIAL_PORT_TYPE_SPI
        #define SERIAL_PORT_TYPE_SPI 1
        #endif
        #ifndef SERIAL_PORT_TYPE_SPI_MASTER
        #define SERIAL_PORT_TYPE_SPI_MASTER 1
        #endif
        #ifndef SERIAL_PORT_TYPE_SPI_SLAVE
        #define SERIAL_PORT_TYPE_SPI_SLAVE 1
        #endif
        #ifndef SERIAL_MANAGER_NON_BLOCKING_MODE
        #define SERIAL_MANAGER_NON_BLOCKING_MODE 1
        #endif
      </RTE_Components_h>
      <files>
        <file category="header" name="components/serial_manager/fsl_component_serial_port_spi.h" projectpath="component/serial_manager"/>
        <file category="sourceC" name="components/serial_manager/fsl_component_serial_port_spi.c" projectpath="component/serial_manager"/>
        <file category="include" name="components/serial_manager/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_swo" Cversion="1.0.0" condition="component.serial_manager_swo.condition_id">
      <description>Component serial_manager_swo</description>
      <RTE_Components_h>
#ifndef SERIAL_PORT_TYPE_SWO
#define SERIAL_PORT_TYPE_SWO 1
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/serial_manager/fsl_component_serial_port_swo.h" projectpath="component/serial_manager"/>
        <file category="sourceC" name="components/serial_manager/fsl_component_serial_port_swo.c" projectpath="component/serial_manager"/>
        <file category="include" name="components/serial_manager/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_uart" Cversion="1.0.0" condition="component.serial_manager_uart.condition_id">
      <description>Component serial_manager_uart</description>
      <RTE_Components_h>
#ifndef SERIAL_PORT_TYPE_UART
#define SERIAL_PORT_TYPE_UART 1
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/serial_manager/fsl_component_serial_port_uart.h" projectpath="component/serial_manager"/>
        <file category="sourceC" name="components/serial_manager/fsl_component_serial_port_uart.c" projectpath="component/serial_manager"/>
        <file category="include" name="components/serial_manager/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_virtual" Cversion="1.0.0" condition="component.serial_manager_virtual.condition_id">
      <description>Component serial_manager_virtual</description>
      <RTE_Components_h>
        #ifndef SSERIAL_PORT_TYPE_VIRTUAL
        #define SSERIAL_PORT_TYPE_VIRTUAL 1
        #endif
        #ifndef DEBUG_CONSOLE_TRANSFER_NON_BLOCKING
        #define DEBUG_CONSOLE_TRANSFER_NON_BLOCKING 1
        #endif
      </RTE_Components_h>
      <files>
        <file category="header" name="components/serial_manager/fsl_component_serial_port_virtual.h" projectpath="component/serial_manager"/>
        <file category="sourceC" name="components/serial_manager/fsl_component_serial_port_virtual.c" projectpath="component/serial_manager"/>
        <file category="include" name="components/serial_manager/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="uart_adapter" Cversion="1.0.0" condition="component.uart_adapter.condition_id">
      <description>Component uart_adapter</description>
      <files>
        <file category="header" name="components/uart/fsl_adapter_uart.h" projectpath="component/uart"/>
        <file category="sourceC" name="components/uart/fsl_adapter_uart.c" projectpath="component/uart"/>
        <file category="include" name="components/uart/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="CMSIS" Csub="MKE12Z9_header" Cversion="1.0.0" condition="device.CMSIS.condition_id">
      <description>Device MKE12Z9_cmsis</description>
      <files>
        <file category="header" name="devices/MKE12Z9/fsl_device_registers.h" projectpath="device"/>
        <file category="header" name="devices/MKE12Z9/MKE12Z9.h" projectpath="device"/>
        <file category="header" name="devices/MKE12Z9/MKE12Z9_features.h" projectpath="device"/>
        <file category="header" name="devices/MKE12Z9/MKE12Z9_COMMON.h" projectpath="device"/>
        <file category="header" name="devices/MKE12Z9/periph9/PERI_ADC.h" projectpath="device/periph9"/>
        <file category="header" name="devices/MKE12Z9/periph9/PERI_CMP.h" projectpath="device/periph9"/>
        <file category="header" name="devices/MKE12Z9/periph9/PERI_CRC.h" projectpath="device/periph9"/>
        <file category="header" name="devices/MKE12Z9/periph9/PERI_DMA.h" projectpath="device/periph9"/>
        <file category="header" name="devices/MKE12Z9/periph9/PERI_DMAMUX.h" projectpath="device/periph9"/>
        <file category="header" name="devices/MKE12Z9/periph9/PERI_EWM.h" projectpath="device/periph9"/>
        <file category="header" name="devices/MKE12Z9/periph9/PERI_FGPIO.h" projectpath="device/periph9"/>
        <file category="header" name="devices/MKE12Z9/periph9/PERI_FLEXIO.h" projectpath="device/periph9"/>
        <file category="header" name="devices/MKE12Z9/periph9/PERI_FTFE.h" projectpath="device/periph9"/>
        <file category="header" name="devices/MKE12Z9/periph9/PERI_FTM.h" projectpath="device/periph9"/>
        <file category="header" name="devices/MKE12Z9/periph9/PERI_GPIO.h" projectpath="device/periph9"/>
        <file category="header" name="devices/MKE12Z9/periph9/PERI_LPI2C.h" projectpath="device/periph9"/>
        <file category="header" name="devices/MKE12Z9/periph9/PERI_LPIT.h" projectpath="device/periph9"/>
        <file category="header" name="devices/MKE12Z9/periph9/PERI_LPSPI.h" projectpath="device/periph9"/>
        <file category="header" name="devices/MKE12Z9/periph9/PERI_LPTMR.h" projectpath="device/periph9"/>
        <file category="header" name="devices/MKE12Z9/periph9/PERI_LPUART.h" projectpath="device/periph9"/>
        <file category="header" name="devices/MKE12Z9/periph9/PERI_MCM.h" projectpath="device/periph9"/>
        <file category="header" name="devices/MKE12Z9/periph9/PERI_MTB.h" projectpath="device/periph9"/>
        <file category="header" name="devices/MKE12Z9/periph9/PERI_MTBDWT.h" projectpath="device/periph9"/>
        <file category="header" name="devices/MKE12Z9/periph9/PERI_MTBDWTROM.h" projectpath="device/periph9"/>
        <file category="header" name="devices/MKE12Z9/periph9/PERI_NV.h" projectpath="device/periph9"/>
        <file category="header" name="devices/MKE12Z9/periph9/PERI_PCC.h" projectpath="device/periph9"/>
        <file category="header" name="devices/MKE12Z9/periph9/PERI_PMC.h" projectpath="device/periph9"/>
        <file category="header" name="devices/MKE12Z9/periph9/PERI_PORT.h" projectpath="device/periph9"/>
        <file category="header" name="devices/MKE12Z9/periph9/PERI_PWT.h" projectpath="device/periph9"/>
        <file category="header" name="devices/MKE12Z9/periph9/PERI_RCM.h" projectpath="device/periph9"/>
        <file category="header" name="devices/MKE12Z9/periph9/PERI_RTC.h" projectpath="device/periph9"/>
        <file category="header" name="devices/MKE12Z9/periph9/PERI_SCG.h" projectpath="device/periph9"/>
        <file category="header" name="devices/MKE12Z9/periph9/PERI_SIM.h" projectpath="device/periph9"/>
        <file category="header" name="devices/MKE12Z9/periph9/PERI_SMC.h" projectpath="device/periph9"/>
        <file category="header" name="devices/MKE12Z9/periph9/PERI_TRGMUX.h" projectpath="device/periph9"/>
        <file category="header" name="devices/MKE12Z9/periph9/PERI_TSI.h" projectpath="device/periph9"/>
        <file category="header" name="devices/MKE12Z9/periph9/PERI_UART.h" projectpath="device/periph9"/>
        <file category="header" name="devices/MKE12Z9/periph9/PERI_WDOG.h" projectpath="device/periph9"/>
        <file category="include" name="devices/MKE12Z9/"/>
        <file category="include" name="devices/MKE12Z9/periph9/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device" Cversion="1.0.0" condition="device.RTE.condition_id">
      <description>Rte_device</description>
      <files>
        <file category="header" attr="config" name="devices/MKE12Z9/template/RTE_Device.h" version="1.0.0" projectpath="board"/>
        <file category="include" name="devices/MKE12Z9/template/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="MKE12Z9_linker" Cversion="1.0.0" condition="device.linker.condition_id">
      <description>Device MKE12Z9_linker</description>
      <files>
        <file condition="allOf.toolchains=mdk, device_ids=MKE12Z512xxx9.condition_id" category="linkerScript" attr="config" name="devices/MKE12Z9/arm/MKE12Z512xxx9_flash.scf" version="1.0.0" projectpath="MKE12Z9/arm"/>
        <file condition="allOf.toolchains=mdk, device_ids=MKE12Z512xxx9.condition_id" category="linkerScript" attr="config" name="devices/MKE12Z9/arm/MKE12Z512xxx9_ram.scf" version="1.0.0" projectpath="MKE12Z9/arm"/>
        <file condition="allOf.toolchains=armgcc, device_ids=MKE12Z512xxx9.condition_id" category="linkerScript" attr="config" name="devices/MKE12Z9/gcc/MKE12Z512xxx9_flash.ld" version="1.0.0" projectpath="MKE12Z9/gcc"/>
        <file condition="allOf.toolchains=armgcc, device_ids=MKE12Z512xxx9.condition_id" category="linkerScript" attr="config" name="devices/MKE12Z9/gcc/MKE12Z512xxx9_ram.ld" version="1.0.0" projectpath="MKE12Z9/gcc"/>
        <file condition="allOf.toolchains=iar, device_ids=MKE12Z512xxx9.condition_id" category="linkerScript" attr="config" name="devices/MKE12Z9/iar/MKE12Z512xxx9_flash.icf" version="1.0.0" projectpath="MKE12Z9/iar"/>
        <file condition="allOf.toolchains=iar, device_ids=MKE12Z512xxx9.condition_id" category="linkerScript" attr="config" name="devices/MKE12Z9/iar/MKE12Z512xxx9_ram.icf" version="1.0.0" projectpath="MKE12Z9/iar"/>
      </files>
    </component>
    <component Cclass="Board Support" Cgroup="SDK Project Template" Csub="project_template" Cvariant="MKE12Z9" Cversion="1.0.0" condition="device.project_template.condition_id" isDefaultVariant="1">
      <description>Devices_project_template MKE12Z9</description>
      <files>
        <file category="header" attr="config" name="devices/MKE12Z9/project_template/board.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MKE12Z9/project_template/board.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MKE12Z9/project_template/clock_config.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MKE12Z9/project_template/clock_config.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MKE12Z9/project_template/pin_mux.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MKE12Z9/project_template/pin_mux.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MKE12Z9/project_template/peripherals.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MKE12Z9/project_template/peripherals.c" version="1.0.0" projectpath="board"/>
        <file category="include" name="devices/MKE12Z9/project_template/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Csub="" Cversion="1.0.0" condition="device.startup.condition_id">
      <description>Device MKE12Z9_startup</description>
      <files>
        <file condition="allOf.toolchains=iar.condition_id" category="sourceAsm" attr="config" name="devices/MKE12Z9/iar/startup_MKE12Z9.s" version="1.0.0" projectpath="startup/iar"/>
        <file condition="allOf.toolchains=armgcc.condition_id" category="sourceAsm" attr="config" name="devices/MKE12Z9/gcc/startup_MKE12Z9.S" version="1.0.0" projectpath="startup/gcc"/>
        <file condition="allOf.toolchains=mdk.condition_id" category="sourceAsm" attr="config" name="devices/MKE12Z9/arm/startup_MKE12Z9.S" version="1.0.0" projectpath="startup/arm"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="CMSIS" Csub="MKE12Z9_system" Cversion="1.0.0" condition="device.system.condition_id">
      <description>Device MKE12Z9_system</description>
      <files>
        <file category="sourceC" name="devices/MKE12Z9/system_MKE12Z9.c" projectpath="device"/>
        <file category="header" name="devices/MKE12Z9/system_MKE12Z9.h" projectpath="device"/>
        <file category="include" name="devices/MKE12Z9/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="acmp" Cversion="2.3.0" condition="driver.acmp.condition_id">
      <description>ACMP Driver</description>
      <files>
        <file category="sourceC" name="devices/MKE12Z9/drivers/fsl_acmp.c" projectpath="drivers"/>
        <file category="header" name="devices/MKE12Z9/drivers/fsl_acmp.h" projectpath="drivers"/>
        <file category="include" name="devices/MKE12Z9/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="adc" Cversion="2.0.8" condition="driver.adc12.condition_id">
      <description>ADC12 Driver</description>
      <files>
        <file category="sourceC" name="devices/MKE12Z9/drivers/fsl_adc12.c" projectpath="drivers"/>
        <file category="header" name="devices/MKE12Z9/drivers/fsl_adc12.h" projectpath="drivers"/>
        <file category="include" name="devices/MKE12Z9/drivers/"/>
      </files>
    </component>
